desafio/app/Controllers/AuthController.php

UPDATE `usuarios` SET `token_criado` = 'eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpYXQiOjE3NDEwMTMxMTAsImV4cCI6MTc0MTAyMDMxMCwic3ViIjoiMSIsImVtYWlsIjoibGVvbmFyZG9jYXN2bSIsIm5vbWUiOiJMRU8ifQ.cBJk-YnIb1B0cgejXb3oStfBWNum_6aPEJBtCsMvymI'
WHERE `usuarios`.`id` IN ('1')
---
    public function login()
    {
        $data = $this->request->getJSON(true);

        $dadosEsperados = ['email', 'senha'];

        foreach ($dadosEsperados as $campo) {
            if (!isset($data[$campo])) {
                return $this->respond(RespostaPronta::resposta('POST', 'login', STATUS400, 'O campo ' . $campo . ' é obrigatório.'));
            }
        }

        $dadosRecebidos = array_keys($data);
        $campoInvalido = array_diff($dadosRecebidos, $dadosEsperados);

        if (!empty($campoInvalido)) {
            return $this->respond(RespostaPronta::resposta('POST', 'login', STATUS400, 'Apenas os dados: ' . implode(', ', $dadosEsperados) . ' são aceitos.'));
        }

        $usuario = $this->model->where('email', $data['email'])->first();
        if ($usuario) {
            $token = $this->gerarToken($usuario['id'], $usuario['nome'], $usuario['email']);
            $this->model->update($usuario['id'], ['token_criado' => $token]);

INSERT INTO `usuarios` (`email`, `senha`, `nome`, `created_at`, `ultimo_token_criado`) VALUES ('senha22222222', 'senha', 'leonardo', '2025-03-01 23:36:55', '2025-03-01 23:36:55')
---
public function registrar()
{
    $data = $this->request->getJSON(true);
    $dadosEsperados = ['nome', 'email', 'senha'];


    if (empty($data)) {
        return $this->respond(RespostaPronta::resposta('GET','registrar',STATUS404,'Envie apenas os dados: ' . implode(', ', $dadosEsperados), null));
    }

    $dadosRecebidos = array_keys($data);

    foreach ($dadosEsperados as $campo) {
        if (!isset($data[$campo])) {
            return $this->respond(RespostaPronta::resposta('GET','registrar', STATUS400,'O campo ' . $campo . ' é obrigatório.'));
        }
    }

    $campoInvalido = array_diff($dadosRecebidos, $dadosEsperados);
    if (!empty($campoInvalido)) {
        return $this->respond(RespostaPronta::resposta('GET','registrar',STATUS400,'Apenas os dados: ' . implode(', ', $dadosEsperados) . ' são aceitos.'));
    }

    $usuarioExistente = $this->model->where('email', $data['email'])->first();
    if ($usuarioExistente) {
        return $this->respond(RespostaPronta::resposta('GET','registrar',STATUS400,'E-mail já cadastrado.'));
    }
    // Insere o usuário no banco de dados
    if (!$this->model->insert($data)) {